app/Controllers/Tenant/LeaseController.php

SELECT *
FROM `leases`
WHERE `tenant_id` = '2'
---
    public function index()
    {
        $tenantId = session()->get('user_id');
        $model = new LeaseModel();

        $leases = $model->where('tenant_id', $tenantId)->findAll();