app/Controllers/Tenant/Main.php

SELECT *
FROM `leases`
WHERE `tenant_id` = '2'
 LIMIT 1
SELECT *
FROM `properties`
WHERE `properties`.`id` = '3'
---
    public function index()
    {
        $tenantId = session()->get('user_id');
        $leaseModel = new LeaseModel();
        $lease = $leaseModel->where('tenant_id', $tenantId)->first();

        $property = null;
        if ($lease) {
            $propertyModel = new PropertyModel();
            $property = $propertyModel->find($lease['property_id']);