app/Controllers/Tenant/MaintenanceController.php

SELECT *
FROM `maintenance_requests`
WHERE `tenant_id` = '2'
---
    public function index()
    {
        $tenantId = session()->get('user_id');
        $model = new MaintenanceRequestModel();
        $requests = $model->where('tenant_id', $tenantId)->findAll();