app/Controllers/Tenant/PaymentController.php

    public function index()
    {
        $tenantId = session()->get('user_id');

        // Get leases for this tenant
        $leaseModel = new LeaseModel();
        $leases = $leaseModel->where('tenant_id', $tenantId)->findAll();
        $leaseIds = array_column($leases, 'id');

        $paymentModel = new PaymentModel();

        // Get all payments associated with this tenant's leases
        $payments = !empty($leaseIds)
            ? $paymentModel->whereIn('lease_id', $leaseIds)->findAll()
---
SELECT *
FROM `leases`
WHERE `tenant_id` = '2'
SELECT *
FROM `payments`
WHERE `lease_id` IN ('1','2','3','4','5','6','7','8')