app/Controllers/Tenant/ProfileController.php

    public function index()
    {
        $userId = session()->get('user_id');
        $userModel = new UserModel();
        $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'