app/Controllers/MessagesController.php

    public function index()
    {
        $userId = session()->get('user_id');
        $messageModel = new MessageModel();

        // Fetch all users except self
        $db = \Config\Database::connect();
        $builder = $db->table('users');
        $users = $builder->where('id !=', $userId)->get()->getResultArray();

        // Add unseen message count per user
        foreach ($users as &$user) {
            $user['unseen_count'] = $messageModel
                ->where('sender_id', $user['id'])
                ->where('receiver_id', $userId)
                ->where('is_read', 0)
                ->countAllResults();
---
SELECT *
FROM `users`
WHERE `id` != '2'
SELECT COUNT(*) AS `numrows`
FROM `messages`
WHERE `sender_id` = '1'
AND `receiver_id` = '2'
AND `is_read` = 0