app/Models/AnnouncementModel.php

    public function getForRole($role)
    {
        return $this->where('target_role', $role)
                    ->orWhere('target_role', 'all')
                    ->orderBy('created_at', 'DESC')
                    ->findAll();
---
SELECT *
FROM `announcements`
WHERE `target_role` = 'tenant'
OR `target_role` = 'all'
ORDER BY `created_at` DESC